Revit 2026 API

# StructuralSectionConcreteTCantileverHeight Property

---

Flange cantilever thickness.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CantileverHeight { get; set; }
```
```vb
Public Property CantileverHeight As Double
	Get
	Set
```
```cpp
public:
property double CantileverHeight {
	double get ();
	void set (double value);
}
```
```fsharp
member CantileverHeight : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace